Revit 2021.1 API
FormatOptions.CanSuppressLeadingZeros Method (DisplayUnitType)
 Checks whether leading zeros can be suppressed for a given display unit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `CanSuppressLeadingZeros(ForgeTypeId)` overload instead.")]
public static bool CanSuppressLeadingZeros(
	DisplayUnitType displayUnit
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `CanSuppressLeadingZeros(ForgeTypeId)` overload instead.")> _
Public Shared Function CanSuppressLeadingZeros ( _
	displayUnit As DisplayUnitType _
) As Boolean
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `CanSuppressLeadingZeros(ForgeTypeId)` overload instead.")]
public:
static bool CanSuppressLeadingZeros(
	DisplayUnitType displayUnit
)
Parameters
displayUnit
Type: Autodesk.Revit.DB.DisplayUnitType
 The display unit.
Return Value
 True if leading zeros can be suppressed, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  displayUnit is an invalid display unit. See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits().
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
FormatOptions Class
CanSuppressLeadingZeros Overload
Autodesk.Revit.DB Namespace